Finished/Rails/Rails_Auth_2/music_app/app/views/bands/show.html.erb


  <% if @band.albums.length > 0 %>

    <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]