Finished/Rails/Rails_Views_and_Auth/ninetynine_cats/app/controllers/cat_rental_requests_controller.rb

  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @cat_rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date") VALUES ($1, $2, $3) RETURNING "id"  [["cat_id", 3], ["start_date", "2020-09-24"], ["end_date", "2020-09-25"]]

  def current_cat_rental_request
    @cat_rental_request ||= CatRentalRequest.includes(:cat).find_by(id: params[:id])
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]