Finished/Rails/Rails_Views_and_Auth/ninetynine_cats/app/controllers/cats_controller.rb

  def create
    @cat = current_user.cats.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("name", "sex", "birth_date", "color", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Six"], ["sex", "M"], ["birth_date", "2020-09-01"], ["color", "White"], ["description", "www"], ["created_at", "2020-09-23 07:30:55.186690"], ["updated_at", "2020-09-23 07:30:55.186690"]]

  def edit
    @cat = current_user.cats.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 1], ["id", nil], ["LIMIT", 1]]

  def update
    @cat = current_user.cats.find(params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "cats" SET "name" = ?, "birth_date" = ?, "color" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["name", "Alpha"], ["birth_date", "2010-01-01"], ["color", "Black"], ["description", "Swag"], ["updated_at", "2020-09-23 07:31:36.184436"], ["id", 6]]