Finished/Rails/Rails_Auth_2/music_app/app/models/user.rb

  def self.generate_session_token
    token = SecureRandom.urlsafe_base64(16)

    while self.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "9AK94bkBpu5LmJAgp_F5fw"], ["LIMIT", 1]]

  def self.generate_verification_token
    token = SecureRandom.urlsafe_base64(16)

    while self.exists?(verification_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."verification_token" = $1 LIMIT $2  [["verification_token", "jNVEmdPYvG_GnILyod0p5g"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "verification_token" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_token", "gC2C1E3_msdD_p2Y105M1Q"], ["verification_token", "R-TRYUiNP2_5E5Dx5YdWfw"], ["updated_at", "2020-10-15 02:10:05.765852"], ["id", 1]]

  def verify!
    self.update_attribute(:activated, true)
---
UPDATE "users" SET "verification_token" = $1, "activated" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["verification_token", "AA5kTHY6u1vkAfYPaCQJ5A"], ["activated", true], ["updated_at", "2020-10-14 08:36:29.312319"], ["id", 2]]

  def make_admin!
    self.update_attribute(:admin, true)
---
UPDATE "users" SET "verification_token" = $1, "admin" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["verification_token", "zK6sP2YF9opPDeeX8RrUcg"], ["admin", true], ["updated_at", "2020-10-15 05:35:21.634346"], ["id", 2]]