Finished/Rails/Routes_and_Controllers/test_project/app/controllers/users_controller.rb

  def create
    new_user = User.new(user_params)

    if new_user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Fernando Cruz"], ["email", "hijodeputa@gmail.com"], ["created_at", "2020-09-15 06:14:57.204438"], ["updated_at", "2020-09-15 06:14:57.204438"]]

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "updated@gmail.com"], ["updated_at", "2020-09-15 06:34:05.696481"], ["id", 1]]