Finished/Rails/Rails_Views_and_Auth/ninetynine_cats/app/models/cat_rental_request.rb

  def approve!
    raise 'Not pending' unless self.status == 'PENDING'

    transaction do
      self.status = 'APPROVED'
      self.save!

      overlapping_pending_requests.each do |request|
        request.update!(status: 'DENIED')
---
UPDATE "cat_rental_requests" SET "status" = $1 WHERE "cat_rental_requests"."id" = $2  [["status", "APPROVED"], ["id", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (end_date < '2016-01-01' OR start_date > '2017-01-01' ) AND (status = 'PENDING')  [["id", 1], ["cat_id", 1]]
UPDATE "cat_rental_requests" SET "status" = $1 WHERE "cat_rental_requests"."id" = $2  [["status", "DENIED"], ["id", 3]]

  def deny!
    self.status = 'DENIED'
    self.save!
---
UPDATE "cat_rental_requests" SET "status" = $1 WHERE "cat_rental_requests"."id" = $2  [["status", "DENIED"], ["id", 1]]

  def overlapping_requests
    CatRentalRequest
      .where.not(id: id)
      .where(cat_id: cat_id)
      .where.not('end_date < ? OR start_date > ? ',
                 start_date.to_date, end_date.to_date)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]