Finished/Rails/Rails_Auth_2/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 1], ["title", "adfdf"], ["year", 2434], ["live", true], ["created_at", "2020-10-13 02:47:52.945287"], ["updated_at", "2020-10-13 02:47:52.945287"]]
---
  def create
    @album = Album.new(album_params)

    if @album.save