Finished/Rails/Rails_Auth_2/music_app/app/controllers/notes_controller.rb

  def create
    note = current_user.notes.new(note_params)
    note.save
---
INSERT INTO "notes" ("user_id", "track_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["track_id", 1], ["content", "great!"], ["created_at", "2020-10-15 02:11:09.197098"], ["updated_at", "2020-10-15 02:11:09.197098"]]

  def destroy
    note = Note.find(params[:id])
    note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]