Finished/Rails/Rails_Auth_2/music_app/app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "bonus" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["lyrics", "aa"], ["bonus", true], ["updated_at", "2020-10-14 04:36:48.667054"], ["id", 2]]
---
  def update
    @track = Track.find(params[:id])

    if @track.update(track_params)