Finished/Rails/Rails_Auth_2/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "verification_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."verification_token" = $1 LIMIT $2  [["verification_token", "5T_RrQnTR2KD502aHBj66g"], ["LIMIT", 1]]
---
  def verify
    user = User.find_by(verification_token: params[:verification_token])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def admin
    user = User.find(params[:id])