Finished/Rails/Rails_Views_and_Auth/ninetynine_cats/app/views/cats/index.html.erb

SELECT "cats"."id", "cats"."name" FROM "cats"
---
      <section class="cat-index">
        <% Cat.all.pluck(:id, :name).each do |cat_id, cat_name| %>