Finished/Rails/Routes_and_Controllers/art_share/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 9], ["viewer_id", 1], ["created_at", "2020-09-16 04:26:56.348862"], ["updated_at", "2020-09-16 04:26:56.348862"]]
---
  def create
    new_share = ArtworkShare.new(artwork_share_params)

    if new_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def favorite
    share = ArtworkShare.find(params[:id])

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", false], ["updated_at", "2020-09-17 07:41:08.910389"], ["id", 1]]
---
  def unfavorite
    share = ArtworkShare.find(params[:id])
    share.favorite = false
    share.save