Finished/Rails/Routes_and_Controllers/art_share/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_collections" ON "artworks"."id" = "artwork_collections"."artwork_id" WHERE "artwork_collections"."collection_id" = $1  [["collection_id", 3]]
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def index
    if params[:user_id]
      user_artworks = Artwork.where(artist_id: params[:user_id])
      shared_artworks = User.find(params[:user_id]).shared_artworks
      render json: user_artworks + shared_artworks
    elsif params[:collection_id]
      collection_artworks = Collection.find(params[:collection_id]).artworks

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Suffering from success"], ["image_url", "swagger.com"], ["artist_id", 2], ["created_at", "2020-09-16 04:30:02.489347"], ["updated_at", "2020-09-16 04:30:02.489347"]]
---
  def create
    new_artwork = Artwork.new(artwork_params)

    if new_artwork.save

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["likeable_type", "Artwork"], ["likeable_id", 1], ["created_at", "2020-09-17 07:17:13.538907"], ["updated_at", "2020-09-17 07:17:13.538907"]]
---
  def like
    new_like = Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Artwork')

    if new_like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["user_id", 2], ["likeable_id", 1], ["likeable_type", "Artwork"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def unlike
    like = Like.find_by(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Artwork')

    if like.destroy

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["id", 3], ["artist_id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", false], ["updated_at", "2020-09-17 07:24:40.751047"], ["id", 3]]
---
  def favorite
    artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])
    artwork.favorite = true
    artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["id", 3], ["artist_id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", false], ["updated_at", "2020-09-17 07:24:40.751047"], ["id", 3]]
---
  def unfavorite
    artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])
    artwork.favorite = false
    artwork.save