Finished/Rails/Routes_and_Controllers/art_share/app/controllers/collections_controller.rb

  def index
    collections = Collection.where(user_id: params[:user_id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 3]]

  def create
    new_collection = Collection.new(collection_params)

    if new_collection.save
---
INSERT INTO "collections" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["user_id", 1], ["created_at", "2020-09-17 08:18:12.482760"], ["updated_at", "2020-09-17 08:18:12.482760"]]

  def show
    collection = Collection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    collection = Collection.find(params[:id])
    collection.destroy
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 4]]

  def add_artwork
    artwork_collection = ArtworkCollection.new(collection_id: params[:collection_id], artwork_id: params[:artwork_id])

    if artwork_collection.save
---
INSERT INTO "artwork_collections" ("collection_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collection_id", 1], ["artwork_id", 2], ["created_at", "2020-09-17 08:14:33.124329"], ["updated_at", "2020-09-17 08:14:33.124329"]]