Finished/Rails/Routes_and_Controllers/art_share/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"
---
  def index
    if params.include?(:user_id)
      render json: Comment.where(user_id: params[:user_id])
    elsif params.include?(:artwork_id)
      render json: Comment.where(artwork_id: params[:artwork_id])
    else
      render json: Comment.all

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    comment = Comment.find(params[:id])

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2020-09-17 07:48:40.834118"], ["updated_at", "2020-09-17 07:48:40.834118"]]
---
  def like
    new_like = Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')

    if new_like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["user_id", 3], ["likeable_id", 1], ["likeable_type", "Comment"], ["LIMIT", 1]]
---
  def unlike
    like = Like.find_by(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')