Finished/Rails/Routes_and_Controllers/art_share/app/controllers/users_controller.rb

  def index
    query = request.query_parameters

    if query.key?(:username)
      render json: User.where('username LIKE ?', query[:username].to_s)
    else
      render json: User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE 'Michelangelo')
SELECT "users".* FROM "users"

  def create
    new_user = User.new(user_params)

    if new_user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-09-16 04:32:26.627729"], ["updated_at", "2020-09-16 04:32:26.627729"], ["username", "Drake"]]

  def favorites
    user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]