Finished/Rails/Rails_Views_and_Auth/ninetynine_cats/app/views/cat_rental_requests/new.html.erb

    <option selected disabled>-- Select a cat --</option>
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"