Finished/Rails/Rails_Auth_2/music_app/app/views/tracks/_form.html.erb


      <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"