Finished/Rails/Rails_Auth_2/music_app/app/views/albums/_form.html.erb


      <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"