Finished/Rails/Rails_Auth_2/music_app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 9]]
---

  <% if @album.tracks.length > 0 %>